app/controllers/school_classes_controller.rb

    def create
        @school_class = SchoolClass.new
        @school_class.title = params['school_class'][:title]
        @school_class.room_number = params['school_class'][:room_number]
        @school_class.save
---
INSERT INTO "school_classes" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2021-02-22 19:44:04.453509"], ["updated_at", "2021-02-22 19:44:04.453509"]]